workstation/openfoam-master-tutorials/tutorials/incompressible/pimpleFoam/RAS/rotatingFanInRoom/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    ( -6.0 -0.5 -0.1)
    (  0.5 -0.5 -0.1)
    (  0.5  5.0 -0.1)
    ( -6.0  5.0 -0.1)
    ( -6.0 -0.5 2.9)
    (  0.5 -0.5 2.9)
    (  0.5  5.0 2.9)
    ( -6.0  5.0 2.9)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (65 55 30) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    allBoundary
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
